Console.Clear();
Console.Write("Введите число: ");
int n = Convert.ToInt32(Console.ReadLine());
int i = 0;
if (i<n)
while (i<n-1)
{
    i += 2;
    Console.Write(i);
}
/* Задача 3: Напишите программу, которая на вход принимает число n и 
выдает все четные числа от 1 до числа n.*/

