Console.Clear();
Console.Write("Введите 1-ое число: ");
int n = Convert.ToInt32(Console.ReadLine());
if (n % 2 == 0)
Console.Write("Введенное Вами число является четным");
else 
Console.Write("Введенное Вами число не является четным");
/* Задача 3: Напишите программу, которая на вход принимает число и выдаёт,
 является ли число чётным (делится ли оно на два без остатка).*/
